<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"stacks/sample_instance","backend":"e71706ed54621ae3e5614b7ddbabe2f32963d0e48114e5be2f63658fcb5a1c02","plan_job_ref":"Job Terraform #6 at https://github.com/o11y-top/aws-terraform-multiple-environments/actions/runs/5369781626","plan_hash":"47ca4b75e31cc2bdaffe8037f19a2c5b9f44d9f0e32d0576034fc6e7cec71862","plan_text_format":"text","version":"1.35.0"} -->
Terraform plan for __stacks/sample_instance__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.sample will be created
  + resource "aws_instance" "sample" {
      + ami                                  = "ami-0ff832bdf91944651"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "sample-instance"
        }
      + tags_all                             = {
          + "Environment" = "Development"
          + "Name"        = "sample-instance"
          + "Stack"       = "sample_instance"
          + "Terraform"   = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sample_instance_id = (known after apply)
```
</details>

:memo: Plan generated in [Terraform #6](https://github.com/o11y-top/aws-terraform-multiple-environments/actions/runs/5369781626)